Revit 2027 API
FilteredElementIdIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual ElementId Current { get; }
Public Overridable ReadOnly Property Current As ElementId
	Get
public:
virtual property ElementId^ Current {
	ElementId^ get ();
}
abstract Current : ElementId with get
override Current : ElementId with get
Property Value
ElementId
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
FilteredElementIdIterator Class
Autodesk.Revit.DB Namespace